<?php

namespace Database\Seeders;

use App\Models\AppStartPage;
use App\Models\Information;
use Illuminate\Database\Seeder;

class InformationSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Information::create([
            'name' => 'عن التطبيق',
            'type' => 'About Us',
            'text' => 'هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة  .
                            هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة  .
                            هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة  .
                            هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة .
                            هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة .
                            هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة .',
        ]);
        Information::create([
            'name' => 'سياسة الخصوصية',
            'type' => 'Privacy',
            'text' => 'هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة  .
                        هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة  .
                        هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة  .
                        هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة .
                        هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة .
                        هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة ..',
        ]);
        Information::create([
            'name' => 'الشروط و الأحكام',
            'type' => 'Rules',
            'text' => 'هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة  .
                            هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة  .
                            هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة  .
                            هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة .
                            هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة .
                            هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص الاول هو مثال لنص يمكن أن يستبدل في نفس المساحة .',
        ]);
    }
}
